Repository: GroupeMINASTE/OCaml
Catalog: OCaml/*.lproj/Localizable.strings
Languages: fr

# chapter_discover_second
source: You can try to execute this code in the 'Code' tab, and see what is does. When you are ready, you can go to the next chapter about variables to start learning OCaml basics.
fr: Vous pouvez essayer d'exécuter ce code dans l'onglet 'Coder' et voir ce qu'il fait. Quand vous êtes prêt, vous pouvez passer au chapitre suivant sur les variables pour commencer les bases d'OCaml.

# chapter_discover_first
source: Let's explain this first sheet of code. What is between '(*' and '*)' is a comment. It is not executed and is here to add awesome explaination about the code. Then there is a 'print_endline': it is a built-in function printing a string to the screen with a return character to go to the next line. Then what is between quotation marks (") is the String which will be printed to the screen. Finally, the ';;' end the statement and return the last think on the stack. (here it is unit, we will details that later)
fr: Expliquons ce premier morceau de code. Ce qui se trouve entre '(*' et '*) est un commentaire. Il n'est pas exécuté et est là pour donner des explications sur notre code. Ensuite, il y a un 'print_endline' : c'est une fonction qui affiche une chaine de caractères à l'écran et retourne à la ligne. Ensuite, ce qui se trouve entre guillemets (") est la chaine de caractères qui sera affichée à l'écran. Enfin, les ';;' finissent l'instruction et retournent la dernière chose sur la pile. (ici unit, on détaillera ça plus tard)

# chapter_discover_comment
source: This is OCaml code
fr: Ceci est du code OCaml

# chapter_discover_welcome
source: Welcome to this first part of the OCaml course!
fr: Bienvenue sur cette première partie du cours sur OCaml !

# chapter_discover_title
source: Discover OCaml
fr: Découvrir OCaml

# sequence_basics
source: The basics
fr: Les bases

# type_chapter
source: Chapter
fr: Chapitre

# commentColor
source: Comments color
fr: Couleur des commentaires

# keywordColor
source: Keywords color
fr: Couleur des mots clés

# identifierColor
source: Identifiers color
fr: Couleur des identifiants

# stringColor
source: Strings color
fr: Couleur des chaines de caractères

# numberColor
source: Numbers color
fr: Couleur des nombres

# plainColor
source: Plain text color
fr: Couleur du texte

source: Background color
fr: Couleur d'arrière plan

source: Editor settings
fr: Paramètres de l'éditeur

# baseconverter
source: Convert numbers and more!
fr: Conversion de nombres et plus !

# delta
source: Math algorithms made easy
fr: Algorithmes de maths faciles

# apps
source: Apps in the same collection
fr: Dans la même collection

# donate_thanks
source: Thanks for donating to our organization!
fr: Merci du don pour notre association !

# donate_footer
source: This donation will help our organization to develop its projects, mainly Extopy, the social network we are working on, which will require some storage for its servers.
fr: Ce don va aider notre association à développer ses projets, notamment Extopy, le réseau social que nous développons, qui va nécessiter principalement du stockage sur ses serveurs.

# donate_header
source: Select an amount to donate:
fr: Sélectionnez le montant à donner :

# donate_title
source: Donate
fr: Faire un don

# button_cancel
source: Cancel
fr: Annuler

# error_unknown
source: Unknown error
fr: Erreur inconnue

# error
source: Error while compiling code
fr: Erreur lors de la compilation du code

# console_failed
source: Failed to load console
fr: Erreur lors du chargement de la console

# developer_text
source: Developed by Nathan Fallet
fr: Développé par Nathan Fallet

source: Developer
fr: Développeur

source: About
fr: A propos

source: Open
fr: Ouvrir

source: Save
fr: Enregistrer

source: Execute
fr: Executer

source: Settings
fr: Paramètres

source: Code
fr: Coder

source: Learn
fr: Apprendre

# chapter_function_recursive_example
source: This is one of the most common example of recursive function: factorial.
fr: C'est un des exemples les plus communs de fonctions récursives : la factorielle.

# chapter_function_recursive_intro
source: A recursive function is a function calling itself again and again. The keyword 'rec' should be added to the declaration to let the compiler know that the function is recursive.
fr: Une fonction récursive est une fonction qui s'appelle elle-même. Le mot clé 'rec' doit être ajouté à la déclaration pour que le compileur sache que la fonction est récursive.

# chapter_function_recursive_title
source: Recursive functions
fr: Fonctions récursives

# chapter_function_signature_auto
source: The signature is automatically determined by the compiler, depending on what the function does with arguments. In our example, we multiply both arguments using the '*' operator, so the only possible signature is the one we have. If we write the same function using '*.', we will have another signature: 'float -> float -> float', because '*.' is defined for floats.
fr: La signature est automatiquement déterminée par le compileur en fonction de ce que la fonction fait avec les arguments. Dans notre exemple, on multiplie les deux arguments en utilisant l'opérateur '*', donc la seule signature possible est celle que l'on a. Si on avait écrit la même fonction en utilisant l'opérateur '*.', on aurait eu une autre signature : 'float -> float -> float', parce que '*.' est défini pour les nombres décimaux.

# chapter_function_signature_details
source: Here, the signature of the function is 'int -> int -> int'. It corresponds, from left to right, to argument types and return type, separated by arrows.
fr: Ici, la signature de la fonction est 'int -> int -> int'. Ça correspond, de gauche à droite, aux types des arguments, et du type retourné, séparés par des flèches.

# chapter_function_signature_intro
source: Let's take back our 'multiply' function to see what's a signature:
fr: Reprenons notre exemple de la fonction 'multiply' pour voir ce qu'est une signature :

# chapter_function_signature_title
source: Function signatures
fr: Signatures de fonctions

# chapter_functions_declaration_calls
source: Finally, we can call a function by using its name, and passing arguments after the name (without paranthesis)
fr: Enfin, on peut appeler une fonction en utilisant son nom, et en passant les arguments après le nom (sans parenthèses)

# chapter_functions_declaration_returns
source: There is no 'return' keywork in OCaml: the last thing on the stack is automatically returned by the function (and if the stack is empty then 'unit' is returned). In this example, the last thing on the stack is 'a * b', so the product of both arguments is returned.
fr: Il n'y a pas de mot clé 'return' en OCaml : la dernière chose sur la pile est automatiquement retournée par la fonction (et si la pile est vide alors 'unit' est retourné). Dans cet exemple, la dernière chose sur la pile est 'a * b', donc le produit des arguments est retourné.

# chapter_functions_declaration_details
source: In this example, we create a function called 'multiply', with two arguments, 'a' and 'b'. Then, after the '=', we write instructions to tell to our function what it does.
fr: Dans cet exemple, on créé une fonction appelée 'multiply', avec deux arguments, 'a' et 'b'. Ensuite, après le '=', on écrit des instructions pour dire à notre fonction ce qu'elle fait.

# chapter_functions_declaration_intro
source: A function is a block. It can take arguments, and it returns a something. Let's see an example to understand how it works:
fr: Une fonction est un bloc. Elle peut prendre des arguments, et elle retourne quelque chose. Prenons un exemple pour comprendre comment ça fonctionne :

# chapter_functions_declaration_title
source: Declare a function
fr: Déclarer une fonction

# sequence_functions
source: Functions
fr: Fonctions

# chapter_strings_concatenation_intro
source: You can concatenate strings using the '^' operator:
fr: Vous pouvez concaténer des chaines de caractères en utilisant l'opérateur '^' :

# chapter_strings_concatenation
source: String concatenation
fr: Concaténation de chaines

# chapter_strings_get_intro
source: It works like arrays, but using '[]' instead of '()':
fr: Ça fonctionne comme pour les tableaux, mais en utilisant '[]' au lieu de '()' :

# chapter_strings_get
source: Get a character in a string
fr: Récupérer un caractère d'une chaine

# chapter_strings_length
source: The same way you get an array length, you can get it for a string:
fr: De la même manière que vous pouvez obtenir la taille d'un tableau, vous pouvez obtenir la taille d'un chaine de caractères :

# chapter_strings_intro
source: Strings act like an array of characters:
fr: Les chaines de caractères agissent comme un tableau de caractères :

# chapter_strings_character
source: Characters
fr: Caractères

# chapter_strings_title
source: Strings
fr: Chaines de caractères

# chapter_arrays_set_details
source: In this example, each value of the array is replaced by 2 times the original value.
fr: Dans cet exemple, chaque valeur du tableau est remplacée par le double de la valeur d'origine.

# chapter_arrays_set_intro
source: You can also set an element to a new value with its index using an arrow:
fr: Vous pouvez aussi remplacer un élément d'un tableau par une nouvelle valeur avec son indice en utilisant une flèche :

# chapter_arrays_set
source: Set an element in an array
fr: Définir un élément d'un tableau

# chapter_arrays_interate_details
source: In this example, k will be incremented from 0 to 3 (len is 4 so len-1 is 3), and for each value of k, the element with the index k will be printed. That way, we can print all elements of an array.
fr: Dans cet exemple, k va être incrémenté de 0 à 3 (len est 4 donc len-1 est 3), et pour chaque valeur de k, l'élément d'indice k va être affiché. De cette manière, on peut afficher tous les éléments d'un tableau.

# chapter_arrays_interate
source: Using a for loop, you can iterate elements of an array like in this example:
fr: En utilisant une boucle for, vous pouvez itérer les éléments d'un tableau comme dans cet exemple :

# chapter_arrays_get_intro
source: You can get elements from an array using its index. The first element's index is 0, and the last one's index is n-1, for an array of length n.
fr: Vous pouvez récupérer un élément d'un tableau en utilisant son indice. L'indice du premier élément est 0, et celui du dernier est n-1, pour un tableau de taille n.

# chapter_arrays_get
source: Get an element from an array
fr: Récupérer un élément d'un tableau

# chapter_arrays_length_intro
source: You can get the length of an array using the Array.length method:
fr: Vous pouvez récupérer la taille d'un tableau en utilisant la méthode Array.length :

# chapter_arrays_length
source: Array length
fr: Taille d'un tableau

# chapter_arrays_create_intro
source: An array is a fixed length set of elements. There are two ways to create an array: either by specifing each element, semicolon separated, between '[|' and '|]', or by repeting an element a fixed number of times.
fr: Un tableau est un ensemble d'éléments de taille fixé. Il y a deux manières de créer un tableau : soit en spécifiant chaque élément, séparés par des point-virgules, entre '[|' et '|]', soit en répétant un élément un nombre fixé de fois.

# chapter_arrays_create
source: Create an array
fr: Créer un tableau

# chapter_arrays_title
source: Arrays
fr: Tableaux

# chapter_loops_unconditional_intro
source: A 'for' loop will run for a fixed set of values:
fr: Une boucle 'for' va tourner pour un certain ensemble de valeurs :

# chapter_loops_unconditional
source: Unconditional loops
fr: Boucles inconditionnelles

# chapter_loops_conditional_intro
source: A 'while' loop will run while a condition is true:
fr: Une boucle 'while' va tourner tant qu'une condition est vraie :

# chapter_loops_conditional
source: Conditional loops
fr: Boucles conditionnelles

# chapter_loops_title
source: Loops
fr: Boucles

# chapter_conditions_operators_logical
source: You can combine condition using logical operators: '&&' for and, '||' for or, and 'not' for not.
fr: Vous pouvez combiner les conditions en utilisant des opérateurs logiques : '&&' pour et, '||' pour ou, et 'not' pour non.

# chapter_conditions_operators_intro
source: Classical comparison operators '<', '>', '<=' and '>=' are the same as usual. For equality operators, '=' is used for a comparison by value, while '==' is used for a comparison by memory address. The same way, '<>' is the inequality by value and '!=' by memory address.
fr: Les opérateurs de comparaison classiques '<', '>', '<=', '>=' sont les mêmes que d'habitude. Pour les opérateurs d'égalité, '=' est utilisé pour les comparaisons par valeur, alors que '==' est utilisé pour les comparaisons par adresse mémoire. De la même manière, '<>' est l'inégalité par valeur et '!=' l'inégalité par adresse mémoire.

# chapter_conditions_operators
source: Conditional operators
fr: Opérateurs conditionnels

# chapter_conditions_multiline_intro
source: In case you need to execute more than one instruction, you can create multiline conditions too by adding 'begin' and 'end' keywords.
fr: Dans le cas où vous avez besoin d'exécuter plusieurs instructions, vous pouvez créer des conditions sur plusieurs lignes en ajoutant les mots clés 'begin' et 'end'.

# chapter_conditions_multiline
source: Multiline conditions
fr: Conditions sur plusieurs lignes

# chapter_conditions_inline_intro
source: You can use inline conditions in any expression with an 'if … then … else …' statement like this example does:
fr: Vous pouvez utiliser des conditions en ligne dans n'importe quelle expression avec une instruction 'if … then … else …' comme le fait cet exemple :

# chapter_conditions_inline
source: Inline conditions
fr: Conditions en ligne

# chapter_operations_print_intro
source: You can print numbers to the console using 'print_int' and 'print_float':
fr: Vous pouvez afficher des nombres dans la console en utilisant 'print_int' et 'print_float' :

# chapter_operations_print
source: Print numbers to the console
fr: Afficher des nombres dans la console

# chapter_operations_funcs_intro
source: Usual functions like 'sin' are also available in OCaml:
fr: Les fonctions usuelles comme 'sin' sont aussi disponibles en OCaml :

# chapter_operations_funcs
source: Usual functions
fr: Fonctions usuelles

# chapter_operations_floats_intro
source: The same kind of operations can be applied to floating point numbers, but operators are not the same and contain a '.' to indicate that they apply on floating point numbers instead of integers.
fr: Le même genre d'opération peut être appliqué sur les nombres décimaux, mais les opérateurs ne sont pas les mêmes et contiennent un '.' pour indiquer qu'ils s'appliquent sur les décimaux et non les entiers.

# chapter_operations_floats
source: Operations on floating point numbers
fr: Opérations sur les nombres décimaux

# chapter_operations_integers_intro
source: In OCaml, like in any language, we can add, subtract, multiply and divide numbers. '+' is the sum, '-' the difference, '*' the product, '/' the quotient, and 'mod' the remainder.
fr: En OCaml, comme dans tous les langages, on peut ajouter, soustraire, multiplier et diviser des nombres. '+' est l'addition, '-' la différence, '/' le quotient, et 'mod' le reste.

# chapter_operations_integers
source: Operations on integers
fr: Opérations sur les entiers

# chapter_operations_title
source: Operations on numbers
fr: Opérations sur les nombres

# chapter_variables_references_details
source: The statement 1 set the value of the reference to 4. Note the usage of ':=' instead of '=' to set the value to the reference instead of the value to the variable (which won't work). The statement 2 returns the reference (of type 'int ref'), while the statement 3 returns the value of the reference (here '4', of type 'int').
fr: L'instruction 1 définie la valeur de la référence à 4. Notez l'usage du ':=' au lieu de '=' pour définir la valeur de la référence au lieu de la valeur de la variable (qui ne fonctionnerait pas). L'instruction 2 retourne la référence (de type 'int ref'), alors que l'instruction 3 retourne la valeur de la référence (ici '4', de type 'int').

# chapter_variables_references_def
source: Here, x is not containing the value 3, but a reference to the value 3. That way, we can change the value that x points to, which is not possible with a classic variable. References can be useful for loops where you need to increment a value for each round, for example.
fr: Ici, x ne contient pas la valeur 3, mais une référence à la valeur 3. De cette manière, on peut changer la valeur vers laquelle x pointe, ce qui n'est pas possible avec une variable classique. Les références peuvent s'avérer utiles pour des boucles dans lesquelles on doit incrémenter une valeur à chaque tour, par exemple.

# chapter_variables_references_intro
source: We can declare mutable variables, called references:
fr: On peut déclarer des variables mutables, appelées références :

# chapter_variables_references
source: Declare references (mutable variables)
fr: Déclarer des références (variables mutables)

# chapter_variables_types_description
source: 'int' and 'float' types represent integrers and floating point numbers. 'bool' represents boolean values, true or false. 'string' represents string, a succession of characters. 'char' represents a single character. Note that a character is defined with single quotes, while a string is defined with double quotes. Finally, 'unit' is the type representing nothing.
fr: 'int' et 'float' représentent des entiers et des décimaux. 'bool' représente les booléens, vrai ou faux (true/false). 'string' représente les chaines de caractères. 'char' représente un caractère seul. Notez qu'un caractère est défini avec des guillemets simples, alors qu'une chaine de caractères est définie avec des guillemets doubles. Enfin, 'unit' est le type qui ne représente rien.

# chapter_variables_types_intro
source: There are different types of variables in OCaml. In the previous example, x was an integer, known as the 'int' type. Here are basic types of variables available in OCaml:
fr: Il y a différents types de variables en OCaml. Dans l'exemple précédent, x était un entier, connu comme le type 'int'. Voici les types de variables disponibles en OCaml :

# chapter_variables_types
source: Variable types
fr: Types de variable

# chapter_variables_def_local2
source: In the first expression, we define a variable, x, available in everything following the 'in' keyword, until a ';;' is reached. So 'x + 4' evaluates to '7'. However, in the second expression, x is not defined, because it was declared locally in the other expression. So we will have an error.
fr: Dans la première expression, on défini une variable, x, disponible dans tout ce qui suit le mot clé 'in', jusqu'à ce qu'on atteigne des ';;'. Dont 'x + 7' est évalué à '7'. Cependant, dans la seconde expression, x n'est pas défini, par il a été déclaré localement dans l'autre expression. Donc on aura une erreur.

# chapter_variables_def_local_comment2
source: Here we have an error
fr: Ici on a une erreur

# chapter_variables_def_local_comment1
source: We define a local x variable
fr: On défini une variable locale x

# chapter_variables_def_local
source: A variable can also be defined locally:
fr: Une variable peut aussi est définie localement :

# chapter_variables_def_global
source: The 'let' keyword indicates that we define a variable. Then follow the name of the variable, x, which is set to a value, 3. The variable is defined globally (it is accessible from everywhere) and is immutable (its value cannot be changed)
fr: Le mot clé 'let' indique que l'on défini une variable. Ensuite vient le nom de la variable, x, qui est définie à une valeur, 3. La variable est définie globalement (elle est accessible de partout) et est immuable (sa valeur ne peut pas être changée)

# chapter_variables_intro
source: A variable is a location in memory where you can store a value. Here is how a variable is created in OCaml:
fr: Une variable est un endroit en mémoire dans lequel on enregistre une valeur. On déclare une variable en OCaml de cette façon :

# chapter_variables_def
source: Local and global variable definition
fr: Définition de variables locales et globales

# menuBarItem.preferences
source: Preferences…
fr: Préférences...
